zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/cy8c4147lce_hvs123.h
/***************************************************************************//**
* \file cy8c4147lce_hvs123.h
*
* \brief
* CY8C4147LCE-HVS123 device header
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CY8C4147LCE_HVS123_H_
#define _CY8C4147LCE_HVS123_H_

/**
* \addtogroup group_device CY8C4147LCE-HVS123
* \{
*/

/**
* \addtogroup Configuration_of_CMSIS
* \{
*/

/*******************************************************************************
*                         Interrupt Number Definition
*******************************************************************************/

typedef enum {
  /* ARM Cortex-M0+ Core Interrupt Numbers */
  Reset_IRQn                        = -15,      /*!< -15 Reset Vector, invoked on Power up and warm reset */
  NonMaskableInt_IRQn               = -14,      /*!< -14 Non maskable Interrupt, cannot be stopped or preempted */
  HardFault_IRQn                    = -13,      /*!< -13 Hard Fault, all classes of Fault */
  SVCall_IRQn                       =  -5,      /*!<  -5 System Service Call via SVC instruction */
  PendSV_IRQn                       =  -2,      /*!<  -2 Pendable request for system service */
  SysTick_IRQn                      =  -1,      /*!<  -1 System Tick Timer */
  /* CY8C4147LCE-HVS123 Peripheral Interrupt Numbers */
  srss_interrupt_srss_IRQn          =   0,      /*!<   0 [DeepSleep] SRSS interrupts */
  srss_wdt_irq_IRQn                 =   1,      /*!<   1 [DeepSleep] WDT Interrupt */
  ioss_interrupt_gpio_IRQn          =   2,      /*!<   2 [DeepSleep] GPIO consolidated interrupt */
  ioss_interrupts_gpio_0_IRQn       =   3,      /*!<   3 [DeepSleep] GPIO P0 */
  ioss_interrupts_gpio_1_IRQn       =   4,      /*!<   4 [DeepSleep] GPIO P1 */
  ioss_interrupts_gpio_2_IRQn       =   5,      /*!<   5 [DeepSleep] GPIO P2 */
  hvss_interrupt_hvss_IRQn          =   6,      /*!<   6 [DeepSleep] HVSS interface interrupt */
  lpcomp_interrupt_IRQn             =   7,      /*!<   7 [DeepSleep] LPCOMP#0 trigger interrupt */
  scb_0_interrupt_IRQn              =   8,      /*!<   8 [DeepSleep] SCB #0 interrupt */
  scb_1_interrupt_IRQn              =   9,      /*!<   9 [DeepSleep] SCB #0 interrupt */
  pass_0_interrupt_ctbs_IRQn        =  10,      /*!<  10 [DeepSleep] CTBm */
  scb_2_interrupt_IRQn              =  11,      /*!<  11 [DeepSleep] SCB #2 interrupt */
  scb_3_interrupt_IRQn              =  12,      /*!<  12 [DeepSleep] SCB #3 interrupt */
  cpuss_interrupt_dma_IRQn          =  13,      /*!<  13 [Active] DMA Interrupt */
  cpuss_interrupt_spcif_IRQn        =  14,      /*!<  14 [Active] SPCIF interrupt */
  cpuss_interrupt_fault_0_IRQn      =  15,      /*!<  15 [Active] Fault structure 0 interrupt */
  cpuss_interrupt_fault_1_IRQn      =  16,      /*!<  16 [Active] Fault structure 1 interrupt */
  lin_interrupts_0_IRQn             =  17,      /*!<  17 [Active] LIN interrupt, channel #0 */
  lin_interrupts_1_IRQn             =  18,      /*!<  18 [Active] LIN interrupt, channel #1 */
  tcpwm_interrupts_0_IRQn           =  19,      /*!<  19 [Active] TCPWM #0, Counter #0 */
  tcpwm_interrupts_1_IRQn           =  20,      /*!<  20 [Active] TCPWM #0, Counter #1 */
  tcpwm_interrupts_2_IRQn           =  21,      /*!<  21 [Active] TCPWM #0, Counter #2 */
  tcpwm_interrupts_3_IRQn           =  22,      /*!<  22 [Active] TCPWM #0, Counter #3 */
  tcpwm_interrupts_4_IRQn           =  23,      /*!<  23 [Active] TCPWM #0, Counter #4 */
  pass_0_interrupt_sar_IRQn         =  24,      /*!<  24 [Active] SAR */
  msc_0_interrupt_IRQn              =  25,      /*!<  25 [Active] CSD */
  cxpi_interrupts_0_IRQn            =  26,      /*!<  26 [Active] CXPI interrupt, channel #0 */
  cxpi_interrupts_1_IRQn            =  27,      /*!<  27 [Active] CXPI interrupt, channel #1 */
  tcpwm_interrupts_5_IRQn           =  28,      /*!<  28 [Active] TCPWM #0, Counter #5 */
  tcpwm_interrupts_6_IRQn           =  29,      /*!<  29 [Active] TCPWM #0, Counter #6 */
  tcpwm_interrupts_7_IRQn           =  30,      /*!<  30 [Active] TCPWM #0, Counter #7 */
  unconnected_IRQn                  = 240       /*!< 240 Unconnected */
} IRQn_Type;


/*******************************************************************************
*                    Processor and Core Peripheral Section
*******************************************************************************/

/* Configuration of the ARM Cortex-M0+ Processor and Core Peripherals */
#define __CM0PLUS_REV                   0x0001U /*!< CM0PLUS Core Revision */
#define __NVIC_PRIO_BITS                2       /*!< Number of Bits used for Priority Levels */
#define __Vendor_SysTickConfig          0       /*!< Set to 1 if different SysTick Config is used */
#define __VTOR_PRESENT                  1       /*!< Set to 1 if CPU supports Vector Table Offset Register */
#define __MPU_PRESENT                   1       /*!< MPU present or not */

/** \} Configuration_of_CMSIS */

#include "core_cm0plus.h"                       /*!< ARM Cortex-M0+ processor and core peripherals */


/* Memory Blocks */
#define CY_SRAM_BASE                    0x20000000UL
#define CY_SRAM_SIZE                    0x00004000UL
#define CY_FLASH_BASE                   0x00000000UL
#define CY_FLASH_SIZE                   0x00020000UL
#define CY_SFLASH_BASE                  0x0FFFE000UL
#define CY_SFLASH_SIZE                  0x00000800UL
#define CY_ROM_BASE                     0x10000000UL
#define CY_ROM_SIZE                     0x00004000UL


